---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.EndConnectorIndex
source: html/dd4f9ccb-412d-d4fc-cf1b-709c7c2e8493.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.EndConnectorIndex Property

The index of the end conector of the flow path.

## Syntax (C#)
```csharp
public int EndConnectorIndex { get; }
```